Revit 2027 API
ParameterTypeId.FamilyElectricalMaintainAnnotationOrientation Property
 "Maintain Annotation Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyElectricalMaintainAnnotationOrientation { get; }
Public Shared ReadOnly Property FamilyElectricalMaintainAnnotationOrientation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyElectricalMaintainAnnotationOrientation {
	ForgeTypeId^ get ();
}
static member FamilyElectricalMaintainAnnotationOrientation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace